Autodesk.Revit.DB.BRepBuilderPersistentIds.IsBRepBuilderGeometryIdFaceOrEdge(Autodesk.Revit.DB.BRepBuilderGeometryId)
Validates the input BRepBuilderGeometryId that will be used to create a correspondence.
In order to be valid, the input BRepBuilderGeometryId must represent the ID of either a Face or an Edge.
Remarks:
This method returns false also in the case when the associated BRepBuilder is not valid.
Call Autodesk.Revit.DB.BRepBuilderPersistentIds.IsAssociatedBRepBuilderValid to check the associated BRepBuilder.
brepBuilderGeometryId:
The BRepBuilderGeometryId to be used in a new correspondence.
Returns:
True if the input BRepBuilderGeometryId represents the ID of either a Face or an Edge, false otherwise.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2022

Autodesk.Revit.DB.BRepBuilderPersistentIds.IsAssociatedBRepBuilderValid
Validates the associated (in the constructor) BRepBuilder for this BRepBuilderPersistentIds.
Returns:
True if the associated BRepBuilder exists, false otherwise.
Since:
2022

Autodesk.Revit.DB.BRepBuilderPersistentIds.IsValidBRepBuilderGeometryIdForNewCorrespondence(Autodesk.Revit.DB.BRepBuilderGeometryId)
Validates the input BRepBuilderGeometryId that will be used to create a correspondence.
In order to be valid, a correspondence for the input BRepBuilderGeometryId must not already exist.
brepBuilderGeometryId:
The BRepBuilderGeometryId to be used in a new correspondence.
Returns:
True if the input BRepBuilderGeometryId can be used to create a new correspondence.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2022

Autodesk.Revit.DB.BRepBuilderPersistentIds.IsValidExternalGeometryIdForNewCorrespondence(Autodesk.Revit.DB.ExternalGeometryId)
Validates the input ExternalGeometryId that will be used to create a correspondence.
In order to be valid, a correspondence for the input ExternalGeometryId must not already exist.
externalGeometryId:
The ExternalGeometryId to be used in a new correspondence.
Returns:
True if the input ExternalGeometryId can be used to create a new correspondence.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2022

Autodesk.Revit.DB.BRepBuilderPersistentIds.AddSubTag(Autodesk.Revit.DB.ExternalGeometryId,Autodesk.Revit.DB.BRepBuilderGeometryId)
Adds a correspondence between an ExternalGeometryId and a BRepBuilderGeometryId.
Note that an existing correspondence in the map cannot be updated and that a
particular BRepBuilderGeometryId may be related to at most one ExternalGeometryId.
externalGeometryId:
An external geometry object Id.
brepBuilderGeometryId:
A BRepBuilder geometry object Id. It must represent the ID of either a Face or an Edge.
Throws Autodesk.Revit.Exceptions.ArgumentException:
externalGeometryId cannot be used to create a new correspondence because it is already used.
-or-
brepBuilderGeometryId cannot be used to create a new correspondence because it is already used.
-or-
brepBuilderGeometryId cannot be used to create a new correspondence because it doesn't represent the ID of either a Face or an Edge.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
The associated BRepBuilder doesn't exist or is not valid (has no Faces and no Edges).
Since:
2022

Autodesk.Revit.DB.BRepBuilderPersistentIds.IsValidObject
Specifies whether the .NET object represents a valid Revit entity.
Remarks:
If the corresponding Revit native object is destroyed, or creation of the corresponding object is undone,
a managed API object containing it is no longer valid. API methods cannot be called on invalidated wrapper objects.
Returns:
True if the API object holds a valid Revit native object, false otherwise.
Since:
2014

Autodesk.Revit.DB.BRepBuilderPersistentIds.#ctor(Autodesk.Revit.DB.BRepBuilder)
Constructs a new BRepBuilderPersistentIds and associates the existing BRepBuilder to it.
bRepBuilder:
The existing BRepBuilder.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2022

Autodesk.Revit.DB.BRepBuilderPersistentIds
This class stores a map from ExternalGeometryIds to BRepBuilderGeometryIds.
Since:
2022